Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D225CD1M.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>LCDC</name>
         <version>11062P</version>
         <description>LCD Controller</description>
         <groupName>LCDC</groupName>
         <prependToName>LCDC_</prependToName>
         <baseAddress>0xF0000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1B58</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>LCDC</name>
            <value>45</value>
         </interrupt>
         <registers>
            <register>
               <name>LCDCFG0</name>
               <description>LCD Controller Configuration Register 0</description>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLKPOL</name>
                     <description>LCD Controller Clock Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKSEL</name>
                     <description>LCD Controller Clock Source Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKPWMSEL</name>
                     <description>LCD Controller PWM Clock Source Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISBASE</name>
                     <description>Clock Gating Disable Control for the Base Layer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISOVR1</name>
                     <description>Clock Gating Disable Control for the Overlay 1 Layer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISOVR2</name>
                     <description>Clock Gating Disable Control for the Overlay 2 Layer</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISHEO</name>
                     <description>Clock Gating Disable Control for the High-End Overlay</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGDISPP</name>
                     <description>Clock Gating Disable Control for the Post Processing Layer</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>LCD Controller Clock Divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDCFG1</name>
               <description>LCD Controller Configuration Register 1</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HSPW</name>
                     <description>Horizontal Synchronization Pulse Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>VSPW</name>
                     <description>Vertical Synchronization Pulse Width</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDCFG2</name>
               <description>LCD Controller Configuration Register 2</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VFPW</name>
                     <description>Vertical Front Porch Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>VBPW</name>
                     <description>Vertical Back Porch Width</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDCFG3</name>
               <description>LCD Controller Configuration Register 3</description>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HFPW</name>
                     <description>Horizontal Front Porch Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>HBPW</name>
                     <description>Horizontal Back Porch Width</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDCFG4</name>
               <description>LCD Controller Configuration Register 4</description>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PPL</name>
                     <description>Number of Pixels Per Line</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>RPF</name>
                     <description>Number of Active Row Per Frame</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDCFG5</name>
               <description>LCD Controller Configuration Register 5</description>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HSPOL</name>
                     <description>Horizontal Synchronization Pulse Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSPOL</name>
                     <description>Vertical Synchronization Pulse Polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSPDLYS</name>
                     <description>Vertical Synchronization Pulse Start</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSPDLYE</name>
                     <description>Vertical Synchronization Pulse End</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPPOL</name>
                     <description>Display Signal Polarity</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DITHER</name>
                     <description>LCD Controller Dithering</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPDLY</name>
                     <description>LCD Controller Display Power Signal Synchronization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>LCD Controller Output Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>OUTPUT_12BPP</name>
                           <description>LCD Output mode is set to 12 bits per pixel</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTPUT_16BPP</name>
                           <description>LCD Output mode is set to 16 bits per pixel</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTPUT_18BPP</name>
                           <description>LCD Output mode is set to 18 bits per pixel</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTPUT_24BPP</name>
                           <description>LCD Output mode is set to 24 bits per pixel</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PP</name>
                     <description>Post Processing Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSPSU</name>
                     <description>LCD Controller Vertical synchronization Pulse Setup Configuration</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSPHO</name>
                     <description>LCD Controller Vertical synchronization Pulse Hold Configuration</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GUARDTIME</name>
                     <description>LCD DISPLAY Guard Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDCFG6</name>
               <description>LCD Controller Configuration Register 6</description>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PWMPS</name>
                     <description>PWM Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PWMPSSelect</name>
                        <enumeratedValue>
                           <name>DIV_1</name>
                           <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_2</name>
                           <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_4</name>
                           <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_8</name>
                           <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_16</name>
                           <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_32</name>
                           <description>The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_64</name>
                           <description>The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWMPOL</name>
                     <description>LCD Controller PWM Signal Polarity</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMCVAL</name>
                     <description>LCD Controller PWM Compare Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDEN</name>
               <description>LCD Controller Enable Register</description>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CLKEN</name>
                     <description>LCD Controller Pixel Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCEN</name>
                     <description>LCD Controller Horizontal and Vertical Synchronization Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPEN</name>
                     <description>LCD Controller DISP Signal Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMEN</name>
                     <description>LCD Controller Pulse Width Modulation Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDDIS</name>
               <description>LCD Controller Disable Register</description>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CLKDIS</name>
                     <description>LCD Controller Pixel Clock Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCDIS</name>
                     <description>LCD Controller Horizontal and Vertical Synchronization Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPDIS</name>
                     <description>LCD Controller DISP Signal Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMDIS</name>
                     <description>LCD Controller Pulse Width Modulation Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKRST</name>
                     <description>LCD Controller Clock Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCRST</name>
                     <description>LCD Controller Horizontal and Vertical Synchronization Reset</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPRST</name>
                     <description>LCD Controller DISP Signal Reset</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMRST</name>
                     <description>LCD Controller PWM Reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDSR</name>
               <description>LCD Controller Status Register</description>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CLKSTS</name>
                     <description>Clock Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDSTS</name>
                     <description>LCD Controller Synchronization status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPSTS</name>
                     <description>LCD Controller DISP Signal Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMSTS</name>
                     <description>LCD Controller PWM Signal Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIPSTS</name>
                     <description>Synchronization In Progress</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCDIER</name>
               <description>LCD Controller Interrupt Enable Register</description>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SOFIE</name>
                     <description>Start of Frame Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISIE</name>
                     <description>LCD Disable Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISPIE</name>
                     <description>Powerup/Powerdown Sequence Terminated Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERRIE</name>
                     <description>Output FIFO Error Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BASEIE</name>
                     <description>Base Layer Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR1IE</name>
                     <description>Overlay 1 Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR2IE</name>
                     <description>Overlay 2 Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HEOIE</name>
                     <description>High-End Overlay Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PPIE</name>
                     <description>Post Processing Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
