Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D225CD1M.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PTC</name>
         <version>44038G</version>
         <description>Peripheral Touch Controller</description>
         <groupName>PTC</groupName>
         <prependToName>PTC_</prependToName>
         <baseAddress>0xFC060000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x36</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PTC</name>
            <value>58</value>
         </interrupt>
         <registers>
            <register>
               <name>CMD</name>
               <description>PTC Command Register</description>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Host Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>NO_ACTION</name>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>Waits for ongoing execution to complete, then stops.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REST</name>
                           <description>Stops and resets</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORT</name>
                           <description>Stops without waiting for ongoing execution to complete.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RUN</name>
                           <description>Starts execution (from stopped state)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>PTC Interrupt Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>NOTIFY0</name>
                     <description>Notification to the Firmware</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ0</name>
                     <description>IRQ0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ1</name>
                     <description>IRQ1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ2</name>
                     <description>IRQ2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRQ3</name>
                     <description>IRQ3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IED</name>
               <description>PTC Enable Register</description>
               <addressOffset>0x35</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IER0</name>
                     <description>IER0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IER1</name>
                     <description>IER1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IER2</name>
                     <description>IER2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IER3</name>
                     <description>IER3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PWM</name>
         <version>6343ZC</version>
         <description>Pulse Width Modulation Controller</description>
         <groupName>PWM</groupName>
         <prependToName>PWM_</prependToName>
         <baseAddress>0xF802C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x464</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PWM</name>
            <value>38</value>
         </interrupt>
         <registers>
            <register>
               <name>CLK</name>
               <description>PWM Clock Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DIVA</name>
                     <description>CLKA Divide Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>DIVASelect</name>
                        <enumeratedValue>
                           <name>CLKA_POFF</name>
                           <description>CLKA clock is turned off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREA</name>
                           <description>CLKA clock is clock selected by PREA</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PREA</name>
                     <description>CLKA Source Clock Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PREASelect</name>
                        <enumeratedValue>
                           <name>CLK</name>
                           <description>Peripheral clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV2</name>
                           <description>Peripheral clock/2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV4</name>
                           <description>Peripheral clock/4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV8</name>
                           <description>Peripheral clock/8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV16</name>
                           <description>Peripheral clock/16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV32</name>
                           <description>Peripheral clock/32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV64</name>
                           <description>Peripheral clock/64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV128</name>
                           <description>Peripheral clock/128</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV256</name>
                           <description>Peripheral clock/256</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV512</name>
                           <description>Peripheral clock/512</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV1024</name>
                           <description>Peripheral clock/1024</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVB</name>
                     <description>CLKB Divide Factor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>DIVBSelect</name>
                        <enumeratedValue>
                           <name>CLKB_POFF</name>
                           <description>CLKB clock is turned off</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PREB</name>
                           <description>CLKB clock is clock selected by PREB</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PREB</name>
                     <description>CLKB Source Clock Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PREBSelect</name>
                        <enumeratedValue>
                           <name>CLK</name>
                           <description>Peripheral clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV2</name>
                           <description>Peripheral clock/2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV4</name>
                           <description>Peripheral clock/4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV8</name>
                           <description>Peripheral clock/8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV16</name>
                           <description>Peripheral clock/16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV32</name>
                           <description>Peripheral clock/32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV64</name>
                           <description>Peripheral clock/64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV128</name>
                           <description>Peripheral clock/128</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV256</name>
                           <description>Peripheral clock/256</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV512</name>
                           <description>Peripheral clock/512</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_DIV1024</name>
                           <description>Peripheral clock/1024</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENA</name>
               <description>PWM Enable Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Channel ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Channel ID</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Channel ID</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIS</name>
               <description>PWM Disable Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Channel ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Channel ID</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Channel ID</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>PWM Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Channel ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Channel ID</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Channel ID</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER1</name>
               <description>PWM Interrupt Enable Register 1</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Counter Event on Channel 0 Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Counter Event on Channel 1 Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Counter Event on Channel 2 Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Counter Event on Channel 3 Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID0</name>
                     <description>Fault Protection Trigger on Channel 0 Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID1</name>
                     <description>Fault Protection Trigger on Channel 1 Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID2</name>
                     <description>Fault Protection Trigger on Channel 2 Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID3</name>
                     <description>Fault Protection Trigger on Channel 3 Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR1</name>
               <description>PWM Interrupt Disable Register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHID0</name>
                     <description>Counter Event on Channel 0 Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID1</name>
                     <description>Counter Event on Channel 1 Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID2</name>
                     <description>Counter Event on Channel 2 Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHID3</name>
                     <description>Counter Event on Channel 3 Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID0</name>
                     <description>Fault Protection Trigger on Channel 0 Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID1</name>
                     <description>Fault Protection Trigger on Channel 1 Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID2</name>
                     <description>Fault Protection Trigger on Channel 2 Interrupt Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCHID3</name>
                     <description>Fault Protection Trigger on Channel 3 Interrupt Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
